In [4]:
import pandas as pd

**Questão 1:**

In [8]:
Mercearia = pd.DataFrame({"loja":["A", "A", "A"],
                          "dia": ["sex", "sab", "dom"],
                          "valor": [7500, 9500, 8200]})

Farmácia = pd.DataFrame({"loja":["B", "B", "B"],
                         "dia": ["sex", "sab", "dom"],
                         "valor": [5100, 8250, 9900]})

Restaurante = pd.DataFrame({"loja":["C", "C"],
                            "dia": ["sab", "dom"],
                            "valor": [7500, 11800]})

dflin = pd.concat([Mercearia, Farmácia, Restaurante], axis=0)
dflin

  loja  dia  valor
0    A  sex   7500
1    A  sab   9500
2    A  dom   8200
0    B  sex   5100
1    B  sab   8250
2    B  dom   9900
0    C  sab   7500
1    C  dom  11800

In [9]:
Mercearia = pd.DataFrame({"loja":["A", "A", "A"],
                          "dia": ["sex", "sab", "dom"],
                          "valor": [7500, 9500, 8200]})

Farmácia = pd.DataFrame({"loja":["B", "B", "B"],
                         "dia": ["sex", "sab", "dom"],
                         "valor": [5100, 8250, 9900]})

Restaurante = pd.DataFrame({"loja":["C", "C"],
                            "dia": ["sab", "dom"],
                            "valor": [7500, 11800]})

dfcol = pd.concat([Mercearia, Farmácia, Restaurante], axis=1)
dfcol

  loja  dia  valor loja  dia  valor loja  dia    valor
0    A  sex   7500    B  sex   5100    C  sab   7500.0
1    A  sab   9500    B  sab   8250    C  dom  11800.0
2    A  dom   8200    B  dom   9900  NaN  NaN      NaN

Ao alinhar entre no eixo das linhas, ele agrupa os df's um abaixo do outro. Já ao agrupar no eixo das colunas, ele alinha os df's lado a lado. No caso do alinhamento por coluna, como em um dos DF's tinha menos colunas que os outros, esses foram substituidos por NaN.

**Questão 2:**

In [18]:
SQL = pd.DataFrame({"email":["rakesh@xyz.com",
"ecg@acmecorpus.com"]})

In [19]:
PYTHON = pd.DataFrame({"email":["ana@xyz.com",
"jonas@acmecorpus.com",
"rakesh@xyz.com"]})

In [20]:
#a)
alunos1=pd.concat([SQL,PYTHON],ignore_index=True)
alunos1=alunos1.drop_duplicates()
alunos1

                  email
0        rakesh@xyz.com
1    ecg@acmecorpus.com
2           ana@xyz.com
3  jonas@acmecorpus.com

In [22]:
#b)
sql_python=SQL.merge(PYTHON)
sql_python

            email
0  rakesh@xyz.com

In [24]:
#c)
sosql=SQL[SQL.email.isin(PYTHON.email)==False]
sosql

                email
1  ecg@acmecorpus.com

In [26]:
sopython=PYTHON[PYTHON.email.isin(SQL.email)==False]
sopython

                  email
0           ana@xyz.com
1  jonas@acmecorpus.com

**Questão 3:**

In [57]:
dic_emp={"id":["D1","D2","D3","D4"],
"nomDepto":["Compras","RH","TI","Vendas"],
"local":["SP","RJ","RJ","SP"]}
dic_func={"num":[3199,3269,3555,3788,3844],
"nome":["Ana","David","José","Marina","Luís"],
"salario":[1600,2975,1500,5000,3000],
"idDepto":["D2","D3",None,"D2","D4"]}

In [58]:
func=pd.DataFrame(dic_func)
func

    num    nome  salario idDepto
0  3199     Ana     1600      D2
1  3269   David     2975      D3
2  3555    José     1500    None
3  3788  Marina     5000      D2
4  3844    Luís     3000      D4

In [59]:
emp=pd.DataFrame(dic_emp)
emp

   id nomDepto local
0  D1  Compras    SP
1  D2       RH    RJ
2  D3       TI    RJ
3  D4   Vendas    SP

In [60]:
juncaodf=pd.merge(func,emp,left_on="idDepto",right_on="id")

In [61]:
juncaodf

    num    nome  salario idDepto  id nomDepto local
0  3199     Ana     1600      D2  D2       RH    RJ
1  3788  Marina     5000      D2  D2       RH    RJ
2  3269   David     2975      D3  D3       TI    RJ
3  3844    Luís     3000      D4  D4   Vendas    SP